app/controllers/forum_threads/forum_posts_controller.rb

INSERT INTO "forum_posts" ("forum_thread_id", "user_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["forum_thread_id", 3], ["user_id", 1], ["body", "Hi"], ["created_at", "2018-10-24 15:20:21.448558"], ["updated_at", "2018-10-24 15:20:21.448558"]]
---
  def create
    @forum_post = @forum_thread.forum_posts.new(forum_post_params)
    @forum_post.user = current_user

    if @forum_post.save

SELECT  "forum_posts".* FROM "forum_posts" WHERE "forum_posts"."forum_thread_id" = ? AND "forum_posts"."id" = ? LIMIT ?  [["forum_thread_id", 4], ["id", 6], ["LIMIT", 1]]
SELECT  "forum_posts".* FROM "forum_posts" WHERE "forum_posts"."forum_thread_id" = ? ORDER BY "forum_posts"."id" ASC LIMIT ?  [["forum_thread_id", 4], ["LIMIT", 1]]
DELETE FROM "forum_posts" WHERE "forum_posts"."id" = ?  [["id", 12]]
---
  def destroy
    @forum_post = @forum_thread.forum_posts.find(params[:id])
    unless @forum_thread.forum_posts.first == @forum_post
      if @forum_post.destroy

SELECT  "forum_threads".* FROM "forum_threads" WHERE "forum_threads"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def set_forum_thread
    @forum_thread = ForumThread.find(params[:forum_thread_id])