app/views/forum_posts/_forum_post.html.haml


- unless @forum_thread.forum_posts.first == forum_post
---
SELECT "forum_posts".* FROM "forum_posts" WHERE "forum_posts"."forum_thread_id" = ?  [["forum_thread_id", 2]]