app/controllers/forum_subjects_controller.rb

  def index
    @forum_subjects = ForumSubject.all
    @forum_threads = ForumThread.all
---
SELECT "forum_subjects".* FROM "forum_subjects"
SELECT "forum_threads".* FROM "forum_threads"

  def create
    @forum_subject = ForumSubject.new(forum_subject_params)
    if @forum_subject.save
---
INSERT INTO "forum_subjects" ("subject_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["subject_name", "ka;eflkja;dlkfjadf"], ["created_at", "2018-10-26 01:52:11.997869"], ["updated_at", "2018-10-26 01:52:11.997869"]]

  def set_forum_subject
    @forum_subject = ForumSubject.find(params[:id])
---
SELECT  "forum_subjects".* FROM "forum_subjects" WHERE "forum_subjects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]