app/controllers/forum_threads_controller.rb

SELECT "forum_threads".* FROM "forum_threads"
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 1], ["id", 2]]
SELECT DISTINCT "forum_threads".* FROM "forum_threads"
---
  def index
    @q = ForumThread.search(params[:q])
    @forum_threads = @q.result(distinct: true).includes(:user)

SELECT  "forum_subjects".* FROM "forum_subjects" WHERE "forum_subjects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    @forum_subject = ForumSubject.find(params[:forum_subject_id])

SELECT  "forum_subjects".* FROM "forum_subjects" WHERE "forum_subjects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "forum_posts" ("forum_thread_id", "user_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["forum_thread_id", 2], ["user_id", 1], ["body", "h;akhdf; adf"], ["created_at", "2018-10-25 18:36:46.239297"], ["updated_at", "2018-10-25 18:36:46.239297"]]
INSERT INTO "forum_threads" ("user_id", "subject", "created_at", "updated_at", "forum_subject_id") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["subject", "tkjea;kjf"], ["created_at", "2018-10-25 18:36:46.237334"], ["updated_at", "2018-10-25 18:36:46.237334"], ["forum_subject_id", 1]]
---
  def create
    @forum_subject = ForumSubject.find(params[:forum_subject_id])
    @forum_thread = @forum_subject.forum_threads.build(forum_thread_params)
    @forum_thread.user = current_user
    # @forum_thread = current_user.forum_threads.new(forum_thread_params)
    @forum_thread.forum_posts.first.user_id = current_user.id

    if @forum_thread.save

SELECT  "forum_threads".* FROM "forum_threads" WHERE "forum_threads"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_forum_thread
    @forum_thread = ForumThread.find(params[:id])