app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user_id = @user.id

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("user_id", "title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["title", "this is a post"], ["body", "test test tes"], ["created_at", "2018-10-23 19:21:57.545362"], ["updated_at", "2018-10-23 19:21:57.545362"]]