app/views/forum_threads/show.html.erb

<br>
<% @forum_thread.forum_posts.each do |post| %>
---
SELECT "forum_posts".* FROM "forum_posts" WHERE "forum_posts"."forum_thread_id" = ?  [["forum_thread_id", 2]]